import React from 'react'
import '../style/components/content.less'
import '../style/essayViewContent/essayViewContent.less'


class EssayViewContent extends React.Component{
    render(){
        return (
            <div id="con">
                <div id="essay-box" className="fl">
                    <div id="essay-history">
                        <span>文章修改历史：</span>
                        <a href="#" className="history-version current-version">1</a>
                        <a href="#" className="history-version">2</a>
                        <a href="#" className="history-version">3</a>
                        <a href="#" className="history-version">4</a>
                    </div>
                    <h1 id="essay-title">文章标题</h1>
                    <div id="essay-content">
                        浅蓝的天际带了些灰，日光正在慢慢隐没。山色猩红如血。通红的山体上，一个个孔洞像是正说着密语，时而呜咽、时而尖啸，过路人入耳惊心。进入峡谷道前，带路的艾厄达特意嘱咐，尽量不向两侧张望，只一意看着脚下山路。然山路极狭，“呜呜”声中，一块块森然怪异的山岩猛然撞入眼中，便连李天水心头亦是一跳。高舍姬更是将头巾捂得很紧。此刻在前方带路的艾厄达忽然停了步，回头道：“克孜尔？喀喇？”“喀喇。”马上的“贵妇”哥舒道元应道。那马鞍辔雕银、障泥流苏，串着珠子的皮缰绳，正稳稳地牵于李天水手中。李天水转头看向哥舒道元。他听出二人说的是突厥语。“克孜尔”意指红色，“喀喇”便是黑色。哥舒眨眨眼，方要开口，身前的舍姬抢道：“克孜尔、红路、喀喇、黑路、红路、红色峡谷、继续向前、黑路么、”舍姬一指前方峡谷弯折处，一面摩天古堡般耸立的山壁，山壁凹凸层叠，约分了七八层，每一层上的石洞，或拱或方，排布得壮美而有秩，线条仿佛由鬼神雕出，“自这山中石窟、穿出去！”“这山形，尽是天造么？”李天水定定地仰头看着那山壁。“千百年来，便是如此。”艾厄达边说边向山脚行去。“这些石窟，你呆过么？”李天水牵了马跟上。“呆过一些，”艾厄达道，“山层间，常有山羊，这里冬天暖些，洞中亦可生火，可以过夜。会有猎人来过冬。只要有一副好胆子。”说话间，四人已至山壁脚下，李天水忽然有种如临神殿的肃穆感。风声益大，自无数个孔洞罅隙中穿出，呜呜声不绝于耳。山脚下是层垒的巨石，一人多高的巨石垒起二三十块。好在石块嶙峋，石块间缝隙很大，艾厄达已踩上石块，背着弓矢长矛，竟如一只岩羊般自如矫健。“贵妇”早下了马，曳地长袍塞回了马上包囊中，李天水看着他胸前紧紧绑定的两个塞满棉布的浑脱胡帽，忽然笑了笑，“仿佛尖了些。”哥舒亦笑了，“亦是软得很，若是被人摸上，便露了馅儿。”舍姬回头瞪了二人一眼，似是嗔怪他二人在这种关头居然还在玩笑。然而越是至生死紧要时刻，往往越是需要尽量令自己放松下来。舍姬抬腿蹬上了石块缝隙，李天水抬手欲扶，舍姬的身躯已蹿了上去，灵活得似一只山蜥蜴，看去竟不比艾厄达慢多少。李天水呆了呆，不由苦笑。哥舒边扎紧衣袂，边笑道：“她早已是个攀岩高人。”李天水转头看向他的马，“但它却绝不可能攀上去。”“它走‘红路’，会在峡谷的出口等我们。”李天水看着这匹华贵的大马，忽然想到了那匹枣红小马，有些黯然，转念一想，即便它再也回不来，于它未尝不是桩好事，便纾解了些，又看了看山壁，道：“黑路，莫不是从这黑洞里走么？”“你猜的不错。”哥舒已将衣袍整束停当。李天水反愣了愣。“这些洞穴，皆能通出去么？”“原本是的。但此刻只有一个洞能走通。艾厄达知道那个洞穴。”李天水便不说话了，伸手从马背上取过行囊，顺势轻抚了抚马首，便抓向了石缝，“噌噌噌”，眨眼间，便已蹿上了两块巨石。哥舒稍慢一些落于最后。不到半刻工夫，四人已先后攀上这堆巨石，立上这座“神殿”的最底层。却见艾厄达仰着头，看着“神殿”第二层山阶上，那处最中央的梯形石洞，一根粗壮的藤条自洞中垂下，越过岩层至他伸手可及之处。李天水听见他咕哝了一声。哥舒也看了过去，“是那个洞么？”艾厄达点点头。“近日有人来过了，”哥舒缓缓道，“而且还留了标识。”“但这附近的猎人，皆是独来独往。”艾厄达沉声道。“无论如何，既有了这藤条，攀上去便轻松不少，”哥舒的声气听去亦颇轻松，“这个洞口，原本难爬得很！”李天水狐疑地看着这根藤条，目光闪烁间，忽沉声道：“我先上。若是这洞内有异，艾厄达以箭矛援救于我！”艾厄达冷冷地看着他，道：“为何你会比一个天山里的猎人更擅攀爬？”“或许不如你，”李天水淡淡道，“但我在沙州，练过些登城侦敌的小技。若是洞内有人，眨眼间我便能翻下来。”※ ※ ※李天水没有翻下来。只见他双手抓定藤条后，收腹蹬腿，人已不见了。随即他们便听到了约定的三声掌声。艾厄达很快攀了上去，哥舒道元慢慢随后——那支箭镞仍留在他左肩，只面不改色，伸手一拉，又将舍姬扶了上来。一转头，却见艾厄达凝立于上窄下宽的洞壁边，定定看向洞内。哥舒与舍姬皱眉走过去，向内一望，亦是一怔。洞内只有李天水，他正凝视着地上一块三四寸宽、六七寸长的木板。杨树枝削出的木板。一侧边缘切出一寸左右宽的凹槽，凹槽刻痕下，洒满黑屑，更有许多被风吹入洞深处。木板边躺着一根木棍，尖端锥形，有些发黑，正对着凹槽。“有人在洞中生过火。”他指着一些黑色的燃屑，隐隐还冒着烟，“生火之人应该未走多久。”“锥弓法。”艾厄达愣愣地盯着那木板，忽地喃喃道。李天水转头看向他，艾厄达却未开口，亦走入梯洞，拾起那根尖锥形的木棍。距尖端七分处，留有两道深深的擦痕，他目光正盯在两道擦痕上。李天水起身缓缓道：“是弓弦的擦痕。”艾厄达缓缓点头。“是一种特别的生火法么？”哥舒目光炯炯，自那木棍移向艾厄达。艾厄达的表情却越来越奇怪，两眼不离那擦痕与尖端，许久，方转过脸看向哥舒，缓缓道：“只有龙族人才会使的生火法。”龙族是龟兹的贱民。原是龟兹北部山民与山北突厥部落的混种。其族人剽勇好斗，常抄略龟兹北边诸镇，阻断商路，渐成边患。百年前，龟兹王与突厥联姻，招引突厥人南下，几乎将龙族屠灭。幸存者或被贩至龟兹为奴，或避入天山为猎民，渐不成气候。艾厄达如此说，自是捅破了出身。“原来你是龙族。”哥舒笑笑，似是随口一说。李天水更似浑然未闻哥舒之言，目光仍牢牢盯住木棍上的擦痕，片刻后，缓缓道：“看这擦痕，恐怕不止一根弓弦，该有两三人同时以弓弦转动木棍。”他若无其事地转过话头。艾厄达看着他二人，远山般淡漠的双眸中，忽然闪过一道热光。感激的热光。洞很深。天光与“呜呜”声渐渐远去。好在那根杨木尖棍已被李天水擦燃。艾厄达执火走在最前，四人不时看向被火光照亮的地面。木板与锥形木棍散乱一地。“该有十几处了吧？”哥舒道元轻声道。他变装后，嗓音语调居然亦变得轻柔了些。“十七处。”李天水沉声道，“至少有将近五十个人。而且这些留下的，应该是不及收拾走的。”“却只至这洞窟一半。”哥舒的嗓音也沉了下来。“洞窟深得奇怪。而更奇怪的是——”“这里现出了那么多龙族猎人的踪迹。”哥舒缓缓接道。李天水凝眉不语，又走了十几步，忽道：“这深洞是天然形成？”哥舒道元叹道：“或许你不信。但我听说千年之前，这洞里便是如此深邃。”“尽头亦有这石阶么？”李天水。这洞窟越走越宽大，窟顶时高时低，尽头处的石壁扭转，壁面现出可踏足而上的石阶。李天水走在艾厄达身侧，看见自己的身影在壁面上晃动。却听艾厄达道，“我族人传说，这片山崖，千万年前，是神族居留的圣殿。殿内曾四通八达。如今只剩一条路。”“黑路？”李天水看着那石壁的台阶道。“黑路，”艾厄达道，“上去吧，跟着你的影子上去。勿回头。”“若是回头会怎样？”李天水皱了眉。“传说走这条黑路，回头的人会成疯子。”艾厄达缓缓道。他话音放落，不知何处又传来一阵沉闷的“呜呜”声。高舍姬微微发颤道：“好像是、这顶上、传下来的。”“这石梯尽处是？”李天水看着那扭曲的石壁转入窟顶更上的黑暗中。“山顶。”艾厄达简短道。李天水忽然回了头，向高舍姬笑了笑。“或许待你爬上山顶，便会觉得没什么可怕。”火光下，他的笑容仿佛将暖意传了过来，高舍姬的神情忽然便镇定了许多。又转过头，看着有些惊愕的艾厄达，淡淡道：“艾兄勿忧，我或许早已是个疯子了。”
                    </div>
                </div>
                <div id="comment-box" className="fr">
                    <div className="comment-content">
                        <div className="commet-author">评论人一：</div>
                        <div className="comment-text">评论内容,评论内容,评论内容,评论内容,评论内容,评论内容,评论内容,评论内容,评论内容,评论内容评论内容,评论内容,评论内容,评论内容,评论内容评论内容,评论内容,评论内容,评论内容,评论内容</div>
                        <div className="comment-date">2018-9-22 11:11:11</div>
                    </div>
                </div>
            </div>
        );
    }
}

export default EssayViewContent;